backend/app/views/api/v1/pantry_items/show.json.jbuilder

json.unit @pantry_item.unit
json.created_at @pantry_item.created_at
---
INSERT INTO "pantry_items" ("user_id", "ingredient_id", "amount", "unit", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["ingredient_id", 56], ["amount", "500.0"], ["unit", "г"], ["created_at", "2026-03-16 11:50:00.394618"], ["updated_at", "2026-03-16 11:50:00.394618"]]