backend/app/views/api/v1/cooking_sessions/show.json.jbuilder


json.steps @session.cooking_step_progresses.includes(:recipe_step).order("recipe_steps.position") do |progress|
---
SELECT "cooking_step_progresses".* FROM "cooking_step_progresses" WHERE "cooking_step_progresses"."cooking_session_id" = $1  [["cooking_session_id", 1]]
SELECT "recipe_steps".* FROM "recipe_steps" WHERE "recipe_steps"."id" IN ($1, $2, $3, $4, $5)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5]]