backend/app/controllers/api/v1/auth_controller.rb

INSERT INTO "users" ("email", "password_digest", "email_confirmed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "test@test.com"], ["password_digest", "[FILTERED]"], ["email_confirmed", false], ["created_at", "2026-03-16 11:36:23.384237"], ["updated_at", "2026-03-16 11:36:23.384237"]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test.com"], ["LIMIT", 1]]
---
      def register
        user = User.new(user_params)
        if user.save
          token = encode_token(user)
          render json: { access_token: token }, status: :created
        else
          if user.errors[:email]&.include?("has already been taken")