backend/app/controllers/api/v1/cooking_steps_controller.rb

SELECT "cooking_sessions".* FROM "cooking_sessions" WHERE "cooking_sessions"."user_id" = $1 AND "cooking_sessions"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "cooking_step_progresses".* FROM "cooking_step_progresses" WHERE "cooking_step_progresses"."cooking_session_id" = $1 AND "cooking_step_progresses"."recipe_step_id" = $2 LIMIT $3  [["cooking_session_id", 1], ["recipe_step_id", 15], ["LIMIT", 1]]
UPDATE "cooking_step_progresses" SET "completed" = $1, "completed_at" = $2, "updated_at" = $3 WHERE "cooking_step_progresses"."id" = $4  [["completed", true], ["completed_at", "2026-03-16 12:25:34.033469"], ["updated_at", "2026-03-16 12:25:34.033681"], ["id", 1]]
---
      def update
        session = current_user.cooking_sessions.find(params[:cooking_session_id])
        progress = session.cooking_step_progresses.find_by!(recipe_step_id: params[:id])

        completed = ActiveModel::Type::Boolean.new.cast(params[:completed])
        progress.update!(
          completed: completed,
          completed_at: completed ? Time.current : nil
        )