backend/app/controllers/api/v1/cooking_sessions_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "cooking_sessions" ("user_id", "recipe_id", "status", "started_at", "finished_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "cooking_step_progresses" ("cooking_session_id", "recipe_step_id", "completed", "completed_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cooking_session_id", 1], ["recipe_step_id", 15], ["completed", false], ["completed_at", nil], ["created_at", "2026-03-16 12:25:33.914839"], ["updated_at", "2026-03-16 12:25:33.914839"]]
---
      def create
        recipe = Recipe.find(params[:recipe_id])
        @session = current_user.cooking_sessions.create!(
          recipe: recipe,
          status: :started,
          started_at: Time.current
        )

        recipe.recipe_steps.each do |step|
          @session.cooking_step_progresses.create!(
            recipe_step: step,
            completed: false
          )

SELECT "cooking_sessions".* FROM "cooking_sessions" WHERE "cooking_sessions"."user_id" = $1 AND "cooking_sessions"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "recipe_steps".* FROM "recipe_steps" WHERE "recipe_steps"."id" IN ($1, $2, $3, $4, $5)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5]]
---
      def show
        @session = current_user.cooking_sessions
          .includes(cooking_step_progresses: :recipe_step, recipe: :recipe_steps)
          .find(params[:id])

SELECT "cooking_sessions".* FROM "cooking_sessions" WHERE "cooking_sessions"."user_id" = $1 AND "cooking_sessions"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
      def finish
        @session = current_user.cooking_sessions.find(params[:id])