backend/app/controllers/api/v1/fridge_recognition_controller.rb

      def create

        suggested = COMMON_CATEGORIES.filter_map do |category|
          ingredient = Ingredient.where("normalized_name LIKE ?", "%#{category}%").first
---
SELECT "ingredients".* FROM "ingredients" WHERE (normalized_name LIKE $1) ORDER BY "ingredients"."id" ASC LIMIT $2  [[nil, "%яйца%"], ["LIMIT", 1]]