backend/app/controllers/api/v1/pantry_items_controller.rb

      def index
        @pantry_items = current_user.pantry_items.includes(:ingredient)
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12)  [["id", 56], ["id", 8], ["id", 7], ["id", 1], ["id", 2], ["id", 3], ["id", 136], ["id", 4], ["id", 120], ["id", 125], ["id", 83], ["id", 128]]
SELECT "pantry_items".* FROM "pantry_items" WHERE "pantry_items"."user_id" = $1 AND "pantry_items"."ingredient_id" IS NOT NULL  [["user_id", 2]]

      def create
        existing = current_user.pantry_items.find_by(ingredient_id: pantry_item_params[:ingredient_id])

        if existing
          existing.assign_attributes(upsert_pantry_item_params(existing))
          @pantry_item = existing
          if @pantry_item.save
---
SELECT "pantry_items".* FROM "pantry_items" WHERE "pantry_items"."user_id" = $1 AND "pantry_items"."ingredient_id" = $2 LIMIT $3  [["user_id", 2], ["ingredient_id", 84], ["LIMIT", 1]]
INSERT INTO "pantry_items" ("user_id", "ingredient_id", "amount", "unit", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["ingredient_id", 56], ["amount", "500.0"], ["unit", "г"], ["created_at", "2026-03-16 11:50:00.394618"], ["updated_at", "2026-03-16 11:50:00.394618"]]
UPDATE "pantry_items" SET "amount" = $1, "unit" = $2, "updated_at" = $3 WHERE "pantry_items"."id" = $4  [["amount", "3333.0"], ["unit", "г"], ["updated_at", "2026-06-23 19:48:51.089659"], ["id", 292]]

      def destroy
        pantry_item = current_user.pantry_items.find(params[:id])
        pantry_item.destroy!
---
SELECT "pantry_items".* FROM "pantry_items" WHERE "pantry_items"."user_id" = $1 AND "pantry_items"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "pantry_items" WHERE "pantry_items"."id" = $1  [["id", 1]]