backend/app/controllers/api/v1/pantry_items_controller.rb

SELECT 1 AS one FROM "pantry_items" WHERE "pantry_items"."ingredient_id" = $1 AND "pantry_items"."user_id" = $2 LIMIT $3  [["ingredient_id", 56], ["user_id", 1], ["LIMIT", 1]]
---
      def create
        @pantry_item = current_user.pantry_items.new(pantry_item_params)
        if @pantry_item.save
          render :show, status: :created
        else
          if @pantry_item.errors[:ingredient_id]&.any? { |e| e.include?("холодильнике") }